In [1]:
import numpy as np
import pandas as pd

In [2]:
data_frame ={
    'A' : [2,5,6,7],
    'B'  : [19,20,21,18],
    'C': [12,11,12,10],
    'D': [8,5,2,7]
}
df = pd.DataFrame(data_frame)
df

   A   B   C  D
0  2  19  12  8
1  5  20  11  5
2  6  21  12  2
3  7  18  10  7

In [3]:
df.shape

(4, 4)

In [4]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
 3   D       4 non-null      int64
dtypes: int64(4)
memory usage: 256.0 bytes

In [6]:
df.describe()

              A          B          C         D
count  4.000000   4.000000   4.000000  4.000000
mean   5.000000  19.500000  11.250000  5.500000
std    2.160247   1.290994   0.957427  2.645751
min    2.000000  18.000000  10.000000  2.000000
25%    4.250000  18.750000  10.750000  4.250000
50%    5.500000  19.500000  11.500000  6.000000
75%    6.250000  20.250000  12.000000  7.250000
max    7.000000  21.000000  12.000000  8.000000

In [7]:
df['B']*10

0    190
1    200
2    210
3    180
Name: B, dtype: int64

### DATA FRAME APPLYING FUNCTION

In [8]:
def square(x):
    return x**2
df['A'].apply(square)

0     4
1    25
2    36
3    49
Name: A, dtype: int64

In [9]:
df['E'] = df['A'].apply(square)
df

   A   B   C  D   E
0  2  19  12  8   4
1  5  20  11  5  25
2  6  21  12  2  36
3  7  18  10  7  49

In [10]:
df['F'] = df['B'].apply(lambda y : y/2)
df

   A   B   C  D   E     F
0  2  19  12  8   4   9.5
1  5  20  11  5  25  10.0
2  6  21  12  2  36  10.5
3  7  18  10  7  49   9.0